In [18]:
import pandas as pd
student_data = pd.DataFrame({
'school_code': ['s001','s002','s003','s001','s002','s004','s001','s003'],
'class': ['V', 'V', 'VI', 'VI', 'V', 'VI','IX','X'],
'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes','Jane','Martin'],
'age': [12, 12, 13, 13, 14, 12, 15, 20],
'height': [173, 192, 186, 167, 151, 159, 140, 160],
'weight': [35, 32, 33, 30, 31, 32, 40, 50]},
 index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6','S7','S8']) 

# student_data.nunique(axis = 0)
student_data.loc[student_data["school_code"] == "s001"].count()[0]

3

In [3]:
grouped_data = student_data.groupby(['school_code', 'class'])      
print((grouped_data.size()))

school_code  class
s001         IX       1
             V        1
             VI       1
s002         V        2
s003         VI       1
             X        1
s004         VI       1
dtype: int64

In [21]:
n = 1                                                              
rows_to_drop=student_data.groupby(['school_code']).tail(n).index
result1 = student_data.drop(rows_to_drop, axis=0)
result1

   school_code class            name  age  height  weight
S1        s001     V  Alberto Franco   12     173      35
S2        s002     V    Gino Mcneill   12     192      32
S3        s003    VI     Ryan Parkes   13     186      33
S4        s001    VI    Eesha Hinton   13     167      30

In [20]:
data = student_data.groupby(['school_code'])
data.tail(1).index

Index(['S5', 'S6', 'S7', 'S8'], dtype='object')

In [4]:
df1 = pd.DataFrame({'name': ['Jack','Ryan','Chris','Sam'],
'rank': [1, 2, 3, 4]})
df2 = pd.DataFrame({'name': ['Ryan', 'Sam', 'Chris', 'Jack'],
'rank': [3, 1, 4, 2]})

print(pd.merge(df1,df2, on="name").columns)

Index(['name', 'rank_x', 'rank_y'], dtype='object')

In [41]:
data = pd.DataFrame({'name': [ 'Jeff', 'Bill', 'Falguni'], 'gender': ['F', 'M', 'F'], 'income': [28000, 25000, 44000]})
data

      name gender  income
0     Jeff      F   28000
1     Bill      M   25000
2  Falguni      F   44000

In [42]:
data["gender"].value_counts()["M"]

1

In [43]:
data.loc[data["gender"] == "M"]["income"].median()

25000.0

In [47]:
data.sort_values(["income"], ascending = False)["name"].iloc[0]

'Falguni'

In [49]:
student_record = pd.DataFrame({'dates':["2015-12-06", "2011-12-27", "2015-09-07", "2012-12-21", "2020-02-13"], 'RID':[498, 721, 375, 464, 813], 'Phy':[22, 45, 1, 65, 22], 'Chem':[52, 56, 32, 50, 24], 'Math':[63, 37, 68, 62, 43]}) 
student_record

        dates  RID  Phy  Chem  Math
0  2015-12-06  498   22    52    63
1  2011-12-27  721   45    56    37
2  2015-09-07  375    1    32    68
3  2012-12-21  464   65    50    62
4  2020-02-13  813   22    24    43

In [64]:
filtered = student_record[student_record["dates"] >= "2014-05-01"].reset_index(drop = True)

In [82]:
filtered.loc[:, "Phy": ].mean(axis = 1)
filtered

        dates  RID  Phy  Chem  Math        avg
2  2020-02-13  813   22    24    43  29.666667
1  2015-09-07  375    1    32    68  33.666667
0  2015-12-06  498   22    52    63  45.666667

In [76]:
filtered.sort_values(["avg"], inplace=True)

In [77]:
filtered["RID"]

2    813
1    375
0    498
Name: RID, dtype: int64

In [78]:
list(filtered["RID"])

[813, 375, 498]

In [84]:
df1 = pd.DataFrame({"A": [1, 2, 3, 4], "B": [11, 22, 33, 44], "C": [111, 222, 333, 444]}, index = ["first", "second", "third", "fourth"])
df1

        A   B    C
first   1  11  111
second  2  22  222
third   3  33  333
fourth  4  44  444

In [92]:
df2 = pd.DataFrame({"D": ["a", "b", "c", "d"], "E": ["aa", "bb", "cc", "dd"], "F":["aaa", "bbb", "ccc", "ddd"]}, index = ["fourth", "fifth", "sixth", "seventh"])
df2

         D   E    F
fourth   a  aa  aaa
fifth    b  bb  bbb
sixth    c  cc  ccc
seventh  d  dd  ddd

In [93]:
d3 = pd.concat([df1, df2])

In [101]:
d3

           A     B      C    D    E    F
first    1.0  11.0  111.0  NaN  NaN  NaN
second   2.0  22.0  222.0  NaN  NaN  NaN
third    3.0  33.0  333.0  NaN  NaN  NaN
fourth   4.0  44.0  444.0  NaN  NaN  NaN
fourth   NaN   NaN    NaN    a   aa  aaa
fifth    NaN   NaN    NaN    b   bb  bbb
sixth    NaN   NaN    NaN    c   cc  ccc
seventh  NaN   NaN    NaN    d   dd  ddd

In [98]:
# Block A
df4 = d3.drop(["fourth"])
df4

           A     B      C    D    E    F
first    1.0  11.0  111.0  NaN  NaN  NaN
second   2.0  22.0  222.0  NaN  NaN  NaN
third    3.0  33.0  333.0  NaN  NaN  NaN
fifth    NaN   NaN    NaN    b   bb  bbb
sixth    NaN   NaN    NaN    c   cc  ccc
seventh  NaN   NaN    NaN    d   dd  ddd

In [100]:
#Block c
d3.loc['fourth','A']*2

fourth    8.0
fourth    NaN
Name: A, dtype: float64

In [104]:
#Block b
df4 = d3.reset_index().drop_duplicates(subset='index', keep='last')          
df4 = df4.set_index('index').sort_index()

df4

           A     B      C    D    E    F
index
fifth    NaN   NaN    NaN    b   bb  bbb
first    1.0  11.0  111.0  NaN  NaN  NaN
fourth   NaN   NaN    NaN    a   aa  aaa
second   2.0  22.0  222.0  NaN  NaN  NaN
seventh  NaN   NaN    NaN    d   dd  ddd
sixth    NaN   NaN    NaN    c   cc  ccc
third    3.0  33.0  333.0  NaN  NaN  NaN